{"posts":[],"tags":[],"categories":[],"pages":[{"title":"Welcome!","text":"My name is Sara Hosseinirad, and I am a PhD candidate at the Control Engineering Laboratory at the University of British Columbia. Additionally, I am employed as a deep learning researcher at Picovoice. My areas of specialization include: Designing deep learning models for performing natural language processing (NLP) tasks on devices that have limited resources. Optimization and model predictive control. Time-series forecasting. Control theory, consisting of adaptive, robust, nonlinear, and optimal techniques. The development of data-driven models. Current WorkAt Picovoice, the company I am currently employed as a deep learning researcher, my responsibilities extend beyond merely contributing to the development of a diverse range of end-to-end natural language processing products. Specifically, I have been leading the development of Eagle, which is an offline, real-time Speaker Recognition system. Currently, I’m also working on incorporating a speaker diarization feature into an existing STT engine while keeping the additional load to a minimum. Current ResearchMy area of expertise and research focus is on creating advanced control algorithms that enhance the efficiency of mechatronic systems. I am presently conducting doctoral research on a novel control system that merges the model predictive control approach with Gaussian process machine learning technology. This cutting-edge system is intended to handle unknown disturbances with quasi-periodic patterns, such as those associated with renewable energy systems’ energy requirements. In addition to my involvement in machine learning tasks, I am also focused on enhancing the performance of the core runtime engine to guarantee optimal speed and efficiency across a multitude of platforms. Moreover, I have had the privilege of working with various SDKs and technologies, such as Rust, Node.js, and WebAssembly. Previous WorkPrior to embarking on my doctoral journey, I worked as a software/mechatronic engineer in several small startups, where I honed my skills in programming for Bare-Metal, RTOS, and Linux systems, developing firmware, and working with a variety of sensor types.","link":"/index.html"},{"title":"Courses","text":"Throughout my academic journey, I have pursued various courses that are vital for my research interests. These include: Advanced Machine Learning (UBC CPSC 540): In this course, I learned advanced topics in machine learning, including deep learning, neural networks, and generative models. The course also covered mathematical foundations for machine learning, optimization techniques, and feature selection methods. Machine Learning and Data Mining (UBC CPSC 532M): This course focused on practical applications of machine learning and data mining, including supervised and unsupervised learning, classification, clustering, and regression. I also learned about data preprocessing, feature extraction, and evaluation methods. Introduction to Artificial Intelligence (UBC CPSC 322): This course provided a comprehensive introduction to artificial intelligence, covering topics such as search algorithms. Control Sensors and Actuators (UBC MECH 520): This course focused on the principles of control sensors and actuators, including topics such as signal conditioning, data acquisition, and transducers. I also learned about control system design and analysis, as well as practical applications in robotics and automation. Foundations in Control Engineering (UBC MECH 522): This course provided an introduction to classical control theory, including topics such as transfer functions, stability analysis, and feedback control. I also learned about frequency domain methods and state-space modeling. Modelling of Dynamic Systems (UBC MECH 529): In this course, I learned about the principles of dynamic systems modeling for complex systems. I also gained hands-on experience with system identification and parameter estimation. Multivariable Feedback and Robust Control (UBC MECH 528): This course covered advanced topics in control theory, including multivariable and robust control. Self-Tuning and Adaptive Control (UBC EECE 574): This course focused on adaptive control techniques, including self-tuning control, model reference adaptive control, and how to tune these controllers optimally. Nonlinear Vibrations: This course gave me an insight into the analysis and design of nonlinear vibration systems, along with an understanding of nonlinear vibration phenomena. Additionally, I was introduced to the principles of nonlinear dynamics and chaos theory. Perturbation methods were also covered as a means of analytical methods for nonlinear vibration analysis. Nonlinear Dynamics &amp; Chaos: This course delved into advanced topics related to nonlinear dynamics such as strange attractors, fractals, and chaotic systems. Vibration of Continuous Systems: This course acquainted me with the principles of vibration analysis of continuous systems, which included wave propagation, modal analysis, and frequency response. Furthermore, I gained knowledge on solving PDEs for vibration analysis and design.","link":"/courses/index.html"},{"title":"Experiences","text":"","link":"/experiences/index.html"},{"title":"Personal Projects","text":"Recycling Plant Simulator: rcplant is a powerful and versatile open-source Python package designed to simulate a recycling plant environment. Its main purpose is to facilitate the evaluation and testing of various classification solutions aimed at addressing the recycling problem. Originally developed as part of a project course at McMaster University, this package provides a comprehensive framework for studying and analyzing recycling processes. Robust Economic Model Predictive Conytol with Application to Solar Thermal Systems: For my PhD research project, I am focused on developing an innovative smart control system that leverages the power of the Gaussian process machine learning technique in conjunction with model predictive control (MPC). My current work involves developing a novel control system that combines MPC with the Gaussian process, which allows for more precise and adaptable control in the face of quasi-periodic disturbances such as hot water demand. Specifically, I am investigating the potential applications of this control system in domestic solar thermal systems, where it has the potential to significantly improve energy efficiency and reduce energy waste. Train Monitoring System: With the aim of improving train safety and reliability, I undertook the design and development of a portable data-logger capable of monitoring various key performance metrics. Specifically, the device I designed can accurately capture and record both the vertical and axial acceleration of a train in motion, as well as the temperature of its wheelset. These data can then be analyzed in real-time to provide timely insights into the train’s performance, and in the case of any anomalies or issues, can alert the control center. Overall, the development of this innovative data-logging device represents an important step forward in the field of train monitoring and has the potential to significantly improve the efficiency and safety of railway transportation systems. Control of Adaptive Optics Systems using Transverse Actuators: As a research project for my master’s degree, I tackled a challenging inverse dynamic problem related to shape control of deformable mirrors, which are crucial components used in modern large telescopes. Employing the powerful PDE-constrained optimization method, I successfully solved this complex problem and generated novel insights that have the potential to revolutionize the field of astrophysics. Through my work, I demonstrated an unwavering dedication to precision and accuracy, as well as a keen ability to utilize advanced mathematical concepts to address real-world challenges. Design, Fabricate, and Control a Double Pendulum System with ARM microcontroller: For the final project of my Mechatronics course, I undertook the ambitious task of designing and fabricating a fully functional double-pendulum system from the ground up. Drawing upon my knowledge of mechanical design, control theory, and programming, I carefully crafted the system to meet my precise specifications. To further enhance its capabilities, I then implemented a digital PID (Proportional-Integral-Derivative) control system using an advanced ARM-based STM32F3DISCOVERY board. GM locomotive’s DC traction motor condition monitoring and fault diagnostics using articifial neural network: The focus of my project was the development of an intelligent monitoring system for DC electric motors, with a particular emphasis on General Motors (GM) locomotives. By leveraging advanced techniques such as vibration analysis and the discrete wavelet transform (DWT), I was able to gain valuable insights into the motors’ condition and performance. Specifically, I utilized a Learning Vector Quantization (LVQ) artificial neural network to analyze the data and provide real-time fault diagnostics. This approach allowed for a more efficient and accurate means of monitoring and maintaining GM locomotive’s DC traction motors. By contributing to the development of sophisticated condition monitoring systems, my work has the potential to enhance safety, reduce downtime, and ultimately improve the overall efficiency of locomotive operations. Design and Fabrication of the Magnetic Electron Lens for a Transmission Electron Microscopy (TEM): Over the course of a three-month project, I undertook the construction and implementation of a magnetic electron lens designed specifically for use within a transmission electron microscope (TEM). This cutting-edge lens was built to the highest specifications, utilizing the latest materials and manufacturing techniques to ensure optimal performance within the TEM environment. The magnetic electron lens is a crucial component within the TEM, responsible for shaping and focusing electron beams to produce high-resolution images of specimens at the atomic scale. Spectrum analysis of Y25 bogie by SRSS and CQC method: Our project team successfully developed an innovative method to accurately evaluate the forces applied to bogies on the rail, without resorting to computationally-intensive dynamic simulations. Our approach relied on a combination of advanced analytical techniques, such as Finite Element Analysis (FEA), and experimental data, which allowed us to obtain precise force measurements with minimal computational burden. This breakthrough has significant implications for the field of railway engineering, as it enables more efficient and accurate evaluation of bogie behavior and facilitates the development of improved designs for rail systems. Dynamic analysis of MD523 Bogie with ADAMS/Rail: Using detailed manufacturing documents as reference, I successfully modeled the MD523 bogie with precision in the advanced software program Adams/Rails. Building upon this model, I conducted an extensive dynamic analysis of the bogie’s performance on four distinct rail classes. Throughout my analysis, I utilized a passenger car as a representative wagon to more accurately predict real-world performance. This rigorous investigation not only allowed for a deeper understanding of the MD523 bogie’s behavior under various conditions but also paved the way for potential improvements and optimizations in future designs. Stress analysis of rolling ball bearing: In this project, I conducted a comprehensive analysis of the rolling ball bearing, utilizing the powerful finite element analysis software ANSYS Workbench. Through this method, I was able to generate detailed and accurate simulations of the bearing’s behavior, allowing for a more thorough understanding of its mechanical properties and performance. Additionally, I compared my ANSYS Workbench results to those obtained through the well-established Hertz theory methodology.","link":"/projects/index.html"},{"title":"Teaching","text":"Instructor: Python Programming (McMaster Manufacturing Research Institute): Taught introductory and advanced Python programming concepts to students. Developed course material, including lectures, exercises, and projects. Assessed student progress through assignments and exams. MATLAB Programming (McMaster Manufacturing Research Institute): Instructed students in MATLAB programming concepts, including arrays, loops, and functions. Designed and delivered course content, such as lectures, labs, and quizzes. Evaluated student performance through homework assignments and assessments. MATLAB &amp; Simulink for Engineers (Sharif University of Technology): Taught MATLAB and Simulink to undergraduate engineering students. Developed and delivered lectures and hands-on exercises to reinforce key concepts. Facilitated group discussions and provided individual support to help students master the software tools. Assessed student progress through individual and group projects, as well as exams. Teaching Assistant:As a teaching assistant and lecturer, I have been involved in teaching various undergraduate and graduate courses at UBC. These include: Electrical Circuits (UBC MECH 221) Instrumentation (UBC MECH 220) Modeling of Mechatronic Systems (UBC MECH 366) Mechatronics System Instrumentation (UBC MECH 421) Mechanical Vibration (UBC MECH 463) Automatic Control (UBC MECH 466) Modelling of Dynamic Systems (UBC MECH 529) Modern Control Engineering (UBC MECH 550) Foundations in Control Engineering (UBC MECH 522)","link":"/teaching/index.html"}]}