{"posts":[],"tags":[],"categories":[],"pages":[{"title":"Bio!","text":"I am Sara Hosseinirad, a Ph.D. candidate and a Vanier Scholar of Canada, at the University of British Columbia (UBC) specializing in Electrical &amp; Computer Engineering. I am currently affiliated with the Biomedical Technologies research group at UBC and work as a AI mdeical imaging research intern under supervison of Dr. Philip Edgcumbe. Previously, I gained valuable experience as a research intern at Honeywell in 2019. Prior to my Ph.D., I completed my M.A.Sc. in Mechanical Engineering at the University of British Columbia and hold a B.Sc. with a dual degree in Aerospace Engineering and Physics at Sharif University of Technology. In terms of my professional skills and background, I possess: Strong object-oriented programming skills in Python and MATLAB. Over 7 years of experience in data-driven modeling and control design, including adaptive, Model Predictive Control (MPC), robust control, and optimal control. Proficiency in areas such as deep learning, reinforcement learning, multi-agent systems, and optimization. Programming SkillsMy programming skills include proficiency in: Python TensorFlow Pytorch Keras scikit-learn SciPy Pandas Matplotlib OpenAI gym OpenCV Streamlit MATLAB &amp; Simulink Control System System Identification Signal Processing Optimization I’m also well-versed in version control using Git and typesetting with LaTeX, with additional experience in SQL, C, Linux, and Gazebo. Feel free to reach out to me for any inquiries or collaboration opportunities.","link":"/index.html"},{"title":"Awards","text":"Throughout my academic and professional journey, I have been fortunate to receive recognition and accolades for my contributions and achievements: Vanier Graduate Scholarship Awarded in 2020 by NSERC/CIHR, Canada 4-Year Doctoral Fellowship Received in 2018 at UBC, Canada Academic Achievement Award Honored in 2018 by the MECH Department at UBC Among the Top 10% of My Class Recognized in 2015 by the Engineering &amp; Physics Department at Sharif University of Technology, Iran Academic Excellence Award Received in 2010 from the National Elites Foundation, Iran Bronze Medal in National Chemistry Olympiad Earned in 2009 at the High School Olympiads in Iran These awards and honors represent a testament to my dedication, hard work, and commitment to academic and professional excellence.","link":"/awards/index.html"},{"title":"Credentials","text":"I have acquired the following credentials, underlining my commitment to continuous learning and professional development: Pre-MICCAI Workshop Attended during the 2023 MICCAI Conference in Vancouver Databases and SQL for Data Science with Python Accredited by IBM on Coursera Divide and Conquer, Sorting and Searching, and Randomized Algorithms Accomplished through Stanford on Coursera Robotics: Computational Motion Planning Attained through the University of Pennsylvania on Coursera Reinforcement Learning Workshop Attended at the 2022 Adconip Conference in Vancouver Multi-Agent RL and Bandit Learning Workshop Participated in at the Simons Institute in Berkeley These credentials underscore my dedication to staying abreast of evolving technologies and broadening my expertise in the field.","link":"/credentials/index.html"},{"title":"Selected Courses","text":"Throughout my academic journey, I undertook a diverse range of courses spanning engineering and physics, expanding my knowledge and skill set: UBC CS Introduction to Machine Learning UBC CS Advanced Machine Learning UBC CS Learning to Move (Reinforcement Learning) UBC CS Convex Optimization UBC CS Computational Optimization UBC ECE Optimal Control UBC ECE Multi-Variable &amp; Robust Control UBC ECE Self-Tuning &amp; Adaptive Control (MPC) UBC ECE Game Theory Flight Dynamics Linear Algebra and Statistics Quantum Mechanics I &amp; II Introduction to Elementary Particles Spectroscopy These courses equipped me with a comprehensive understanding of various technical domains and enabled me to broaden my expertise in both engineering and physics disciplines. Other online courses, mainly on Algoritm (code) Divide and Conquer, Sorting and Searching, and Randomized Algorithms Accomplished through Stanford on Coursera Graph Search, Shortest Paths, and Data Structure Accomplished through Stanford on Coursera Stanford, Coursera Robotics: Computational Motion Planning Attained through the University of Pennsylvania on Coursera","link":"/courses/index.html"},{"title":"Experiences","text":"Research: online explanation Projects Leadership Teaching Research:inja cheert of pert begoo Projects:inja ham begoo ki be kie","link":"/experiences/index.html"},{"title":"Leadership","text":"Vice President of External Relations UBC Graduate Student Society May 2019 – April 2020 | Vancouver, Canada As the elected Vice President of External Relations for the UBC Graduate Student Society, I played a pivotal role in pioneering and executing advocacy campaigns aimed at benefiting graduate students. These efforts resulted in an increase in available resources and enhanced services for the student community. I successfully fostered strong partnerships and collaborations with the BC government and UBC executives. This collaboration led to the initiation and implementation of various projects aimed at providing vital support to students. Middle Eastern and North African Women in Tech Team Member Sep 2018 – Sep 2019 | Vancouver As a team member with the Middle Eastern and North African Women in Tech, I actively contributed to the coordination and organization of impactful networking and mentorship events for MENA women in the tech sector in Vancouver. This involvement allowed me to support and empower women in technology and contribute to the local tech community.","link":"/leadership/index.html"},{"title":"Projects","text":"AI PROTOTYPE OF SPINSIGHT MRI (TECH-E Course Project): I created a dashboard using Streamlit to showcase the predictive capabilities of MRNet, a deep neural network, in diagnosing an ACL tear in the knee. Furthermore, I conducted comprehensive business model analyses to validate the feasibility and viability of the Spinsight MRI project. Undergraduate Coanda UAV Project*: As an undergraduate student, I was part of a dedicated team that successfully designed and built a prototype of a Coanda Unmanned Aerial Vehicle (UAV). This project allowed me to gain hands-on experience in aircraft design and engineering, as well as the principles of aerodynamics. Our team’s achievement in creating a functional UAV prototype demonstrated our ability to collaborate effectively and apply theoretical knowledge to real-world engineering challenges.","link":"/projects/index.html"},{"title":"Research","text":"AI Medical Imaging (Research Intern) (Oct 2024 - May 2025)I Developed and validated an MLP algorithm to classify abnormalities in the NIH X-ray dataset and PE in converted X-ray from the CTPE datasetusing the Google CXR foundation model. (0.93 AUC for test dataset with 0.95% confidence interval (0.90, 0.96)).I also converted VGH CT scan to X-ray DICOMs for the next stage of our research. AI-Assisted Anesthesia (Ph.D. Research): (2020 - Present) (Supervisor: Prof. Guy Dumont)I led the research project on AI-Assisted Anesthesia, and as a result, one manuscript has been accepted for publication in the Journal of Clinical Monitoring and Computing, while another manuscript is currently in progress. Data Processing: In this project, I was responsible for cleaning and processing clinical time-series data, including EEG signals. Model Identification: I employed data-driven techniques to identify the model of anesthesia and Validated the robustness and performance of a controller designed based on the identified models (paper). Anesthesia Response Simulation: My master student collaborator and I developed a comprehensive multi-agent simulation of anesthesia as a Python package and a Matlab toolbox. (paper in progress) Data-Driven Predictive Control: As part of the research, I am developing a data-driven predictive control for multi-loop control and multi-drug injection, considering safety constraint and comparing it with a deep reinforcement agent.This controller is compared with a generalized MPC and a simple RL agent. These contributions have been instrumental in advancing the field of automated anesthesia, increasing safety and efficiency in drug administration, and reducing the risk of overdose. Learning in Multi-Agent Systems (Ph.D. Research): (2022- 2024) (Supervisor: Prof. Maryam Kamgarpour) I implemented various model-based and model-free policy gradient algorithms for multi-agent systems, providing practical solutions for complex control problems. Additionally, my work includes offering theoretical insights into the performance of Reinforcement Learning (RL) in scenarios such as formation control of a swarm of robots and the control of the distributed power system contributing to the understanding of RL in real-world applications. Non-Local Control Approach for Nonlinear Systems (Research intern at Honeywell): (May 2019-Oct 2019) I led research focused on developing an innovative control approach for nonlinear systems utilizing data-driven non-local models. Throughout this research, I collaborated closely with a research principal from Honeywell Inc., fostering productive industry-academic cooperation. Optimal Control of Integrated Solar Thermal Systems (M.A.Sc. Reseach): (2016 - 2018) I proposed a novel optimal control strategy for solar thermal systems, leading to significant increases in energy efficiency. You can access the related paper here. Additionally, I implemented computational optimization techniques to determine optimal configurations based on solar energy availability and energy efficiency. For further details, please refer to the corresponding paper here. Satellite Attitude Control (B.Sc. Research) (2015) I conducted in-depth research on satellite attitude control and devised an optimal controller using dynamic programming. This controller is designed to precisely control satellite attitudes using impulse thrusters. In the course of the research, I modeled the 3DoF dynamics of a satellite using quaternion coordination and developed an optimal controller for satellite attitudes using the dynamic programming optimization technique. This innovative approach was a key feature of the project. To assess the effectiveness of the technique, I conducted thorough simulation analyses, providing valuable insights into the performance and viability of the developed control strategy.","link":"/research/index.html"},{"title":"Course Taught","text":"During my academic career, I had the opportunity to teach the following courses, sharing my knowledge and expertise with students: Automatic Control, MECH 466 Control Systems, ELEC 441 Matlab Control Toolbox Systems and Control, ELEC 341 Dynamic Lab, MECH 221 Heat Transfer, MECH 375 Introduction to Vibration Teaching these courses allowed me to impart valuable insights and foster the growth of students in these subject areas.","link":"/teaching/index.html"}]}